{
  "backend/main.mo": "Main Motoko canister implementing user profiles, owner authentication, menu CRUD, orders, and shop settings with access control and blob storage mixins.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for many frontend source files.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for customer and owner areas within ThemeProvider and CartProvider.",
  "frontend/src/components/brand/ShopLogo.tsx": "Displays shop logo from settings or fallback image with adjustable sizes.",
  "frontend/src/components/customer/OffersPanel.tsx": "Renders grid of special offers from local offer state or hides when none exist.",
  "frontend/src/components/guards/OwnerGuard.tsx": "Protects owner routes by checking authentication and redirecting or showing an access denied card.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation for customer/owner areas, mobile menu, and notification badges.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including loading stored identities and handling login/logout.",
  "frontend/src/hooks/useOrderNotifications.ts": "Tracks new orders for shop owners and triggers audio and browser notifications when new orders appear.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor functions such as menu CRUD, orders, and shop settings.",
  "frontend/src/index.css": "Sets up Tailwind and defines custom light/dark theme color variables and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/customer/CartPage.tsx": "Displays the customer’s cart, allowing quantity updates, item removal, and showing order totals.",
  "frontend/src/pages/customer/CheckoutPage.tsx": "Handles checkout flow with validation, places orders via mutation, and shows success or redirects if cart is empty.",
  "frontend/src/pages/customer/MenuPage.tsx": "Fetches and displays menu items with loading skeletons, separating available and unavailable items, and allows adding items to the cart.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login landing page offering customer and shop owner login paths with styled UI components.",
  "frontend/src/pages/owner/admin/AdminMenuPage.tsx": "Admin interface to list, add, edit, and delete menu items using CRUD mutations with a dialog form.",
  "frontend/src/pages/owner/admin/AdminOffersPage.tsx": "Admin page for managing offers, supporting create, update, and delete actions through a dialog-driven form.",
  "frontend/src/pages/owner/admin/AdminOrdersPage.tsx": "Renders the admin orders dashboard, fetching orders, sorting them, displaying status badges, and allowing status updates with notifications.",
  "frontend/src/pages/owner/admin/AdminSettingsPage.tsx": "Displays and updates shop settings including name and logo, handling file uploads, validation, and persistence.",
  "frontend/src/pages/owner/OwnerLoginPage.tsx": "Provides owner login with passcode authentication, handling admin status checks and navigation on success.",
  "frontend/src/state/cart.tsx": "Provides a React context for cart state with add, remove, quantity update, persistence in localStorage, and total calculation.",
  "frontend/src/state/offers.ts": "Implements a hook for managing promotional offers with localStorage persistence and CRUD operations.",
  "frontend/src/state/ownerAuth.ts": "Handles simple owner authentication state using sessionStorage with set, check, and clear functions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, plugins, animations, and content paths.",
  "project_state.json": "Metadata file describing project state, issues, and configuration for project management tooling."
}